{
  "artifact_type": "template_skeleton",
  "club_class": "long_irons_hybrids",
  "clubs": ["5i", "6i", "4h", "5h"],
  "judgment_metrics": [
    {
      "metric": "smash_factor",
      "role": "judgmental",
      "direction": "higher_is_better",
      "rationale": "Core strike quality indicator; directly reflects center contact"
    },
    {
      "metric": "ball_speed",
      "role": "judgmental",
      "direction": "higher_is_better",
      "rationale": "Energy transfer efficiency; especially critical for long clubs where speed loss is magnified"
    },
    {
      "metric": "descent_angle",
      "role": "judgmental",
      "direction": "higher_is_better",
      "rationale": "Adequate descent required for distance control; shallow descent indicates poor launch"
    }
  ],
  "diagnostic_metrics": [
    {
      "metric": "spin_rate",
      "role": "diagnostic",
      "rationale": "Informational but not grade-driving; acceptable spin range is wider for long clubs; low spin may be intentional for some players"
    },
    {
      "metric": "carry_distance",
      "role": "diagnostic",
      "rationale": "Used for gapping validation and trend monitoring; not grade-driving because distance control intent varies"
    },
    {
      "metric": "launch_angle",
      "role": "diagnostic",
      "rationale": "Informational for trajectory assessment; not grade-driving because acceptable range is wide"
    }
  ],
  "excluded_metrics": [
    {
      "metric": "club_speed",
      "rationale": "Speed is outcome, not strike quality; can vary intentionally"
    },
    {
      "metric": "attack_angle",
      "rationale": "Swing characteristic, not strike quality; out of Phase 0 scope"
    },
    {
      "metric": "face_angle",
      "rationale": "Directional control, not strike quality; out of Phase 0 scope"
    },
    {
      "metric": "club_path",
      "rationale": "Swing characteristic, not strike quality; out of Phase 0 scope"
    }
  ],
  "c_definition": "C-shot indicates poor contact quality: thin/fat strike (low smash), insufficient ball speed for distance, or shallow descent angle. These shots lack the solid contact required for consistent distance.",
  "notes": "Long irons/hybrids prioritize solid contact and distance. Spin is DOWNGRADED to diagnostic because acceptable spin range is wider and player-dependent. Only 3 judgment metrics (smash, ball speed, descent). This prevents over-penalizing shots with intentionally lower spin."
}
